# 3. Задайте последовательность чисел. Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности в том же порядке.
#
# in
# 7
#
# out
# [4, 5, 3, 3, 4, 1, 2]
# [5, 1, 2]


# from random import *
#
# ls = [int(uniform(0, 20)) for i in range(10)]
# print(ls)
#
#
# def sort(nums):
#     res = []
#     temp = nums[0]
#     count = 0
#     for i in range(nums):
#         for j in range(nums):
#             if nums[i] == nums[j]


